export const title = "あいうえおひょう";

export const colors = [
  "bg-sky-500", // 水色
  "bg-blue-500", // 青
  "bg-teal-500", // 青緑
  "bg-indigo-500", // 藍
  "bg-purple-500", // 紫
  "bg-pink-500", // ピンク
  "bg-red-500", // 赤
  "bg-yellow-500", // 黄
];

export const groups = [
  ["あ", "い", "う", "え", "お"], // あ行
  ["か", "き", "く", "け", "こ"], // か行
  ["さ", "し", "す", "せ", "そ"], // さ行
  ["た", "ち", "つ", "て", "と"], // た行
  ["な", "に", "ぬ", "ね", "の"], // な行
  ["は", "ひ", "ふ", "へ", "ほ"], // は行
  ["ま", "み", "む", "め", "も"], // ま行
  ["や", "ゆ", "よ", "", ""], // や行（3文字）
  ["ら", "り", "る", "れ", "ろ"], // ら行
  ["わ", "を", "ん", "", ""], // わ行（3文字）
];
